app/Controllers/Admin/Anggota.php

    public function index()
    {
        if (!$this->isSecure()) return redirect()->to(site_url('/admin/login'))->with('msg', [0, 'Sesi anda telah kadaluarsa.']);

        $data = [
            "anggota" => $this->anggota->find(),
            "judul" => "Anggota"
        ];
---
SELECT *
FROM `tbl_anggota`