app/Controllers/Admin/Berkas.php

    public function index()
    {
        if (!$this->isSecure()) return redirect()->to(site_url('/admin/login'))->with('msg', [0, 'Sesi anda telah kadaluarsa.']);

        $data = [
            "berkas" => $this->berkas->find(),
            "judul" => "Berkas"
        ];
---
SELECT *
FROM `tbl_berkas`