app/Controllers/Admin/Galeri.php

    public function index()
    {
        if (!$this->isSecure()) return redirect()->to(site_url('/admin/login'))->with('msg', [0, 'Sesi anda telah kadaluarsa.']);

        $data = [
            "galeri" => $this->galeri->find(),
            "judul" => "Galeri"
        ];
---
SELECT *
FROM `tbl_galeri`