app/Controllers/Admin/Kampus.php

SELECT *
FROM `tbl_kampus`
---
    public function index()
    {
        if (!$this->isSecure()) return redirect()->to(site_url('/admin/login'))->with('msg', [0, 'Sesi anda telah kadaluarsa.']);

        $data = [
            "kampus" => $this->kampus->find(),
            "judul" => "Kampus"
        ];