app/Controllers/Auth.php

				return redirect()->to(site_url("daftar"))->with('msg', [1, "Gagal Mendaftar"]);
			}
		} else { // kondisi validasi error
			$kampus = $this->kampus->find();
---
SELECT *
FROM `tbl_kampus`