app/Controllers/Home.php

SELECT *
FROM `tbl_galeri`
---
    public function index()
    {
        $data = [
            'banner' => $this->banner->find(),
            'galeri' => $this->galeri->find(),

SELECT *
FROM `tbl_kampus`
---
    public function kampus()
    {
        $kampus = $this->kampus->find();

SELECT *
FROM `tbl_struktur`
---
    function struktur()
    {
        $struktur = $this->struktur->find();