app/Models/AnggotaModel.php

SELECT *
FROM `tbl_anggota`
WHERE `username` = '123'
 LIMIT 1
---
	public function getByUsername(string $username)
	{
		return $this->db->table($this->table)
			->where('username', $username)
			->limit(1)
			->get()
			->getRow();